Обработки/Reports/_СписокЦБКлиентаДУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_СписокЦБКлиентаДУ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимОтбора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговораДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_СписокЦБКлиентаДУ/Ext/ObjectModule.bsl
#Область Регистрационные_данные

// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Список ценных бумаг клиента ДУ",
		"0.19",
		"",
		Истина
	);
		
	// команды отсутствуют - только интерактивный запуск
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

#КонецОбласти

#Область Стандартные_процедуры_и_функции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;	
	КонецЕсли;
	
	// Заполняем параметры СКД
	ПараметрыДанных = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных;
	
	ПараметрыДанных.УстановитьЗначениеПараметра("Организация",							ЭтотОбъект.Организация);
	ПараметрыДанных.УстановитьЗначениеПараметра("СчетДоверительногоУправления",			ЭтотОбъект.СчетДоверительногоУправления);
	ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОтчета",							КонецДня(ЭтотОбъект.ДатаОтчета));
	ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОтчетаГраница",					Новый Граница(КонецДня(ЭтотОбъект.ДатаОтчета), ВидГраницы.Включая));
	ПараметрыДанных.УстановитьЗначениеПараметра("РежимОтбора",							ЭтотОбъект.РежимОтбора);
	ПараметрыДанных.УстановитьЗначениеПараметра("Клиент",								ЭтотОбъект.Клиент);
	ПараметрыДанных.УстановитьЗначениеПараметра("ВидДоговораДоверительногоУправления",	ЭтотОбъект.ВидДоговораДоверительногоУправления);
	
	КлючТекущегоВарианта = Неопределено;
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("КлючТекущегоВарианта", КлючТекущегоВарианта);
	ПараметрыДанных.УстановитьЗначениеПараметра("ВариантОтчета",	КлючТекущегоВарианта);
	
	// Заполняем настройки печати	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, ЭтотОбъект.Метаданные().ПолноеИмя(), Ложь, ОриентацияСтраницы.Портрет);
	
	РаботаСОтчетами.ВыполнитьКомпоновкуПрограммно(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		
	Если ЭтотОбъект.РежимОтбора = 0 Тогда
		
		Если ПроверяемыеРеквизиты.Найти("Клиент") <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить("Клиент");
		КонецЕсли;
		
		ПроверяемыеРеквизиты.Добавить("СчетДоверительногоУправления");
		
	Иначе
		
		Если ПроверяемыеРеквизиты.Найти("СчетДоверительногоУправления") <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить("СчетДоверительногоУправления");
		КонецЕсли;
		
		ПроверяемыеРеквизиты.Добавить("Клиент");
		
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти

#Область Автоматизация_формирования_отчета

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	
	Настройки.Добавить("АвтоматическаяВыгрузкаВЭДО");
	Настройки.Добавить("АвтоматическаяОтправка");
	Настройки.Добавить("АдресОтправителя");
	Настройки.Добавить("АдресЭлектроннойПочты");
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("ВремяФормирования");
	Настройки.Добавить("КаталогОтправленныхОтчетов");
	Настройки.Добавить("КаталогФайловДляОтправкиПоЭДО");
	Настройки.Добавить("КаталогФайловСОшибкойОтправкиПоЭДО");
	Настройки.Добавить("ОтправлятьОтчетВСоставеПакета");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СохранятьФайлПриОтправке");
	Настройки.Добавить("СрокПредоставления");
	Настройки.Добавить("СрокФормирования");
	Настройки.Добавить("КлючТекущегоВарианта");
	
	Возврат Настройки;

КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	ЭтотОбъект.ДатаОтчета = НастройкиОтчета.Период.ДатаОкончания;
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	СкомпоноватьРезультат(ДокументРезультат);
	
	НастройкиОтчета.Вставить("Результат", ДокументРезультат);
	
КонецПроцедуры

#КонецОбласти
